### 2021.06.03 복습 내용
'''
난이도: 중
풀이: 성공
'''


### [6. 완전탐색 (백트랙킹, 상태트리와 CUT EDGE)-DFS(깊이우선탐색)기초 - 01] 재귀함수를 이용한 이진수 출력
'''
나머지: n//2
몫: n%2

깊이우선탐색의 종료조건 - if문
'''

def DFS(x):

  # DFS의 종료조건
  if x == 0:
    return

  DFS(x//2)
  # 첫번째로 명령한 것이 맨 마지막에 출력되어야 하므로, 재귀함수 아래 명령어 작성
  print(x%2, end ='')


if __name__ == '__main__': 
  n = int(input())
  DFS(n)



### [6. 완전탐색 (백트랙킹, 상태트리와 CUT EDGE)-DFS(깊이우선탐색)기초 - 02] 이진트리 순회(깊이우선탐색)

'''
이진트리탐색 아이디어
01. 노드 v의 왼쪽 노드는 V*2, 오른쪽 노드는 V*2+1
02. 종료조건 - 최대 노드의 값보다 커지면 함수는 종료

* 전위순회: 부모, 왼쪽, 오른쪽
* 중위순회: 왼쪽, 부모, 오른쪽
* 후위순회: 왼쪽, 오른쪽, 부모
※ 전중후의 기준이 부모노드라고 생각하자! 순서는 무조건 왼쪽에서 오른쪽으로 흐른다!
'''

def DFS(x):
  if x>num:
    return
  else:
    DFS(x*2)
    print(x)
    DFS(x*2+1)
    

if __name__ == '__main__':
  num = int(input())
  DFS(1) 
